[{"url": "http://www.alcheringa.in", "content": "Enter the Gamescape", "title": "<title>Alcheringa IIT Guwahati</title>", "data": "", "tags": ""},
{"url": "http://www.alcheringa.in/concerts/", "content": "", "title": "<title>Alcheringa - Concerts</title>", "data": "", "tags": ""},
{"url": "http://www.alcheringa.in/webops/", "content": "RAVI NISHANTRAHUL NAGURTAAnkur SethPuneet KumarAkriti KaurAnkita AnshuShubhangi GuptaSURAJ JHA", "title": "<title>Alcheringa IIT Guwahati</title>", "data": "", "tags": ""},
{"url": "http://www.alcheringa.in/specials/", "content": "Distances should not come in your way to glory and too bridge all gaps we come to your doorstep in the search of raw talent. Alcheringa conducted City Audition in Ten Cities Across India for its major events this year. Rock-o-Phonix was conducted in six cities across India namely Pune, Bangalore, Mumbai, Delhi, Kolkata and Hyderabad. Crossfade, the DJ competition was conducted in Mumbai, Delhi and Bangalore.Auditions for other major competitions from Drama and Dance Module were conducted in many cities including Jaipur, Patna, Indore and Bhopal.This is a quadrant that sets Alcheringa apart. Far from the glitz and glamour associated with the biggest names in the entertainment industry, Alcheringa acts as the mouthpiece addressing various issues faced by our society. Alcheringa has initiated nationwide campains in the past, tackling raging issues such as AIDS awareness, Human Trafficking and the Save the Gangetic Dolphin campaign. Some of the campaigns have also dealt with issues faced by students, such as the JEE counselling Campaign.\n                    \n                        North East India is like a microcosm of India with its on diversity in terms of Languages, Culture, Arts and Religion. There is a need to promote and unveil the true potential of this part of country. Our campaigns hits the nail on its head by promoting the shared identity and culture that this part of country shares with other parts of nation, by showcasing; through videos and posters the rich and diverse food and travel destinations and by running information campaigns to develop entrepreneurship and to remove stereotypes from the minds of general people about this part of country. Originated under the name \"Bachpan\" in 2011, Udaan is a social initiative taken by the students of IIT Guwahati which aims on delivering hope to those who never had the opportunity. It aims in the upliftment of the underprivileged through the conduction of various educational workshops and innovational programs.\nDuring their vacations, students from IIT Guwahati and several other colleges conduct Udaan where they reach out to various underprivileged children from orphanages, villages and slums in their locality and spare a weekend to give flights to their hopes with the help of various documentaries, presentations, games and motivation. Udaan covers more than 40 cities across India. \nOur mission is to rewrite the pages of a few thousand lives that were thought to be too cheap to live. To reach out to them and to inspire them and to adorn their lives with some wonderful moments.", "title": "<title>Alcheringa IIT Guwahati</title>", "data": "", "tags": "Pick a card !CITY AUDITIONSINITIATIVES"},
{"url": "http://www.alcheringa.in/events/", "content": "", "title": "<title>Alcheringa IIT Guwahati</title>", "data": "", "tags": ""},
{"url": "http://www.alcheringa.in/registrations/", "content": "", "title": "<title>Registrations | Alcheringa, IIT Guwahati</title>", "data": "", "tags": ""},
{"url": "http://www.alcheringa.in", "content": "Enter the Gamescape", "title": "<title>Alcheringa IIT Guwahati</title>", "data": "", "tags": ""},
{"url": "http://www.alcheringa.in/events/index.html", "content": "", "title": "<title>Alcheringa IIT Guwahati</title>", "data": "", "tags": ""},
{"url": "http://www.alcheringa.in/registrations/index.php", "content": "", "title": "<title>Registrations | Alcheringa, IIT Guwahati</title>", "data": "", "tags": ""},
{"url": "http://www.alcheringa.in/informals/", "content": "", "title": "<title>Alcheringa Informals</title>", "data": "", "tags": ""}]